In [3]:
import pandas as pd
import numpy as np
import seaborn as sns

In [22]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'taxis',
 'tips',
 'titanic']

In [41]:
df = sns.load_dataset('penguins')

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [43]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [44]:
#groupby
g = df.groupby(['species','island'])
g.body_mass_g.mean()

species    island
Adelie     Biscoe       3709.659091
           Dream        3688.392857
           Torgersen    3706.372549
Chinstrap  Dream        3733.088235
Gentoo     Biscoe       5076.016260
Name: body_mass_g, dtype: float64

In [45]:
#unstack
g.body_mass_g.mean().unstack()

island          Biscoe        Dream    Torgersen
species
Adelie     3709.659091  3688.392857  3706.372549
Chinstrap          NaN  3733.088235          NaN
Gentoo     5076.016260          NaN          NaN

In [46]:
g.body_mass_g.agg([np.sum,np.mean])

                          sum         mean
species   island
Adelie    Biscoe     163225.0  3709.659091
          Dream      206550.0  3688.392857
          Torgersen  189025.0  3706.372549
Chinstrap Dream      253850.0  3733.088235
Gentoo    Biscoe     624350.0  5076.016260

In [51]:
df.pivot_table(['body_mass_g'],
              index = [df.species, df.sex],
              columns = df.island, aggfunc = "mean", fill_value =0)

                  body_mass_g
island                 Biscoe        Dream    Torgersen
species   sex
Adelie    Female  3369.318182  3344.444444  3395.833333
          Male    4050.000000  4045.535714  4034.782609
Chinstrap Female     0.000000  3527.205882     0.000000
          Male       0.000000  3938.970588     0.000000
Gentoo    Female  4679.741379     0.000000     0.000000
          Male    5484.836066     0.000000     0.000000

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB